# BaseEquipment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..BaseEquipment Property
MEPSystem Class See Also
---
The base panel or equipment of the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstance BaseEquipment { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseEquipment As FamilyInstance
	Get
```

Visual C++
---
```text
public:
property FamilyInstance^ BaseEquipment {
	FamilyInstance^ get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace